{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "nb_filter": 32, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_1", "border_mode": "same", "input_dtype": "float32", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "batch_input_shape": [null, 3, 64, 64], "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_filter": 32, "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_3", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_4", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_5", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_filter": 128, "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_6", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_filter": 128, "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_7", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_filter": 256, "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_8", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_filter": 256, "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 256, "name": "dense_1", "b_regularizer": null, "input_dim": 2048, "bias": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 256, "name": "dense_2", "b_regularizer": null, "input_dim": 256, "bias": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "name": "dense_3", "b_regularizer": null, "input_dim": 256, "bias": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}]}